docs/KBhalgos_ps_6_fsm.html
<?xml version="1.0" encoding="utf-8"?>
<!DOCTYPE html PUBLIC "-//W3C//DTD XHTML 1.0 Strict//EN"
"http://www.w3.org/TR/xhtml1/DTD/xhtml1-strict.dtd">
<html xmlns="http://www.w3.org/1999/xhtml" lang="en" xml:lang="en">
<head>
<!-- 2022-05-11 Wed 22:36 -->
<meta http-equiv="Content-Type" content="text/html;charset=utf-8" />
<meta name="viewport" content="width=device-width, initial-scale=1" />
<title>Algos PS#6 FSM</title>
<meta name="generator" content="Org mode" />
<meta name="author" content="Houjun Liu" />
<link rel="stylesheet" href="/global.css" type="text/css"/>
<link rel="stylesheet" href="/admonition.css" type="text/css"/>
<link rel="stylesheet" href="https://quantumish.github.io/admonition.css" />

</head>
<body>
<div id="preamble" class="status">
<div class="header"><span class="site"><a href="https://taproot3.sanity.gq">TR3.5</a></span></div><div class="datarow"><h1 class="title">Algos PS#6 FSM</h1> <h2 class="subtitle"></h2> <span class="author">Houjun Liu</span> <span class="date">2022-05-11 Wed 22:36</date></div>
</div>
<div id="content">
<div id="linktables"><div id="table-of-backlinks"><h2>Backlinks</h2><ul></ul></div><div id="table-of-contents"><h2>Table of Contents</h2><div id="text-table-of-contents">
<ul>
<li><a href="#org964c37d">1. Fifteen Square Puzzle</a>
<ul>
<li><a href="#orgca0fb19">1.1. Defining Transitions</a></li>
<li><a href="#org564b6fe">1.2. Proving Invariant</a></li>
<li><a href="#orgb5904bd">1.3. Proving Invariant through Transitions</a>
<ul>
<li><a href="#org6af2008">1.3.1. Moving Up-Down</a></li>
<li><a href="#org6c389c0">1.3.2. Moving Left-Right</a></li>
</ul>
</li>
<li><a href="#org5c58558">1.4. Proving Invariant to End</a></li>
</ul>
</li>
<li><a href="#orgc92d945">2. Fast Exponentiation</a>
<ul>
<li><a href="#org2161690">2.1. Analyzing Traditional Exponentiation</a></li>
<li><a href="#org8af4b16">2.2. Fast Exponentiation as FSM</a></li>
<li><a href="#org9ad895f">2.3. FSM Proof</a></li>
<li><a href="#org0a54b3a">2.4. The Algorithm Terminates</a></li>
</ul>
</li>
</ul>
</div></div>
</div>

<div id="outline-container-org964c37d" class="outline-2">
<h2 id="org964c37d"><span class="section-number-2">1</span> Fifteen Square Puzzle</h2>
<div class="outline-text-2" id="text-1">
<p>
From the definition of the problem, we have the state \((A,B)\):
</p>

<ul class="org-ul">
<li>\(A\) is a list \((a_1\ldots a_{15})\) with all the values skipping the empty square</li>
<li>\(B\) is a tuple \((X,Y)\) containing the coordinates of the empty square</li>
</ul>

<p>
We also define "out of order" as pairs of not-necessarily-continuous values that are not strictly increasing, and "parity" as \(mod\ 2\) of the number of out-of-order pairs plus the row number of the empty square.
</p>
</div>

<div id="outline-container-orgca0fb19" class="outline-3">
<h3 id="orgca0fb19"><span class="section-number-3">1.1</span> Defining Transitions</h3>
<div class="outline-text-3" id="text-1-1">
<p>
For every single case, there is four possible transitions to make
</p>

<ol class="org-ol">
<li>Move empty square up</li>
<li>Move empty square down</li>
<li>Move empty square left</li>
<li>Move empty square right</li>
</ol>
</div>
</div>

<div id="outline-container-org564b6fe" class="outline-3">
<h3 id="org564b6fe"><span class="section-number-3">1.2</span> Proving Invariant</h3>
<div class="outline-text-3" id="text-1-2">
<p>
We will show that the base state has a specific parity. At \(((1\ldots 15), (4,4))\), the starting base state, it has parity \(0 + 4 = 0 (mod\ 2)\).
</p>

<p>
Let's declare parity \(=0\ (mod\ 2)\) as the invariant.
</p>
</div>
</div>

<div id="outline-container-orgb5904bd" class="outline-3">
<h3 id="orgb5904bd"><span class="section-number-3">1.3</span> Proving Invariant through Transitions</h3>
<div class="outline-text-3" id="text-1-3">
<p>
Let's prove that invariant is invariant through all transitions. We will do so in pairs, as the "moving square" operation is isomorphic by up-down and left-right pairs.
</p>
</div>

<div id="outline-container-org6af2008" class="outline-4">
<h4 id="org6af2008"><span class="section-number-4">1.3.1</span> Moving Up-Down</h4>
<div class="outline-text-4" id="text-1-3-1">
<p>
Moving the empty square up-down constitutes adding/removing three pairs of out-of-order items&#x2014;shifting a empty square up would result in the item three-items-back to be moved ahead by three items. 
</p>

<p>
Adding three out-of-order pairs, plus subtracting one row from the empty square position, would result in a change in parity of \(3-1 = 0\ (mod\ 2)\). It follows that reversing the operation would result in \(-3+1=0\ (mod\ 2)\).
</p>

<p>
Shifting up/down does not change the invariant.
</p>
</div>
</div>

<div id="outline-container-org6c389c0" class="outline-4">
<h4 id="org6c389c0"><span class="section-number-4">1.3.2</span> Moving Left-Right</h4>
<div class="outline-text-4" id="text-1-3-2">
<p>
Moving an empty square left-right neither changes the row number for the empty row nor the order of the items. Hence, it does not change the items that constitute the parity&#x2014;making the parity the same and invariant.
</p>
</div>
</div>
</div>

<div id="outline-container-org5c58558" class="outline-3">
<h3 id="org5c58558"><span class="section-number-3">1.4</span> Proving Invariant to End</h3>
<div class="outline-text-3" id="text-1-4">
<p>
At the final end state, there is \({15 \choose 2}\) out of order pairs (choose any of the tiles, choose any other one, swapping the order would be the same choice, but choosing two of the same is not.)
</p>

<p>
Hence:
</p>

\begin{equation}
\frac{15!}{2!(13!)}  = \frac{15\times14}{2}  = 105
\end{equation}

<p>
At the final state, the empty row is at row \(4\). \(4+105 = 1\ (mod\ 2)\), loosing the invariant.
</p>

<p>
By Floyd's invariant method, we see that the final state is not in invariant and hence <b>not</b> reachable from the base state via the Moving Up-Down and Moving Left-Right operations.
</p>
</div>
</div>
</div>

<div id="outline-container-orgc92d945" class="outline-2">
<h2 id="orgc92d945"><span class="section-number-2">2</span> Fast Exponentiation</h2>
<div class="outline-text-2" id="text-2">
</div>
<div id="outline-container-org2161690" class="outline-3">
<h3 id="org2161690"><span class="section-number-3">2.1</span> Analyzing Traditional Exponentiation</h3>
<div class="outline-text-3" id="text-2-1">
<p>
The running time of traditional exponentiation is \(O(k)\), where \(k\) is the power by which to raise. This is simply because an increase in the power of \(k\) will result in a linear \(+1\) increase in the number of multiplications.
</p>
</div>
</div>

<div id="outline-container-org8af4b16" class="outline-3">
<h3 id="org8af4b16"><span class="section-number-3">2.2</span> Fast Exponentiation as FSM</h3>
<div class="outline-text-3" id="text-2-2">
<p>
Base state: \((a,1,b)\).
</p>

<p>
At every state \((x,y,z)\):
</p>

<p>
If \(z\) is odd:
</p>

<ul class="org-ul">
<li>Set \(y=xy\)</li>
<li>Set \(z=\frac{z-1}{2}\)</li>
</ul>

<p>
If \(z\) is even:
</p>

<ul class="org-ul">
<li>Set \(z= \frac{z}{2}\)</li>
</ul>

<p>
Finally, \(x = x^2\)
</p>

<p>
Furthermore, \(z\) is our derived variable counting down to \(0\). If \(z=0\), \(y\) is the result returned. 
</p>
</div>
</div>

<div id="outline-container-org9ad895f" class="outline-3">
<h3 id="org9ad895f"><span class="section-number-3">2.3</span> FSM Proof</h3>
<div class="outline-text-3" id="text-2-3">
<p>
We will set the fact that \(x\ (mod\ y) = 0\) as our invariant. At the base state, where \(y=1\), this is trivially true.
</p>

<p>
At every state update, the value of \(y\) either stays unchanged or is scaled by \(x\).
</p>

<p>
In the former case, our new value of \(x={x_0}^2\) is also \(0\ (mod\ y_0)\) as \(na=0\ (mod\ b)\) if \(a=0\ (mod\ b)\).
</p>

<p>
In the latter case, the new value of \(x\) &#x2014; \(x^2\), per every step &#x2014; is also \(0\ (mod\ y)\) as we can separate the new value of y into \(y = xy_0\), which the former \(x\) term dividing out one of the two \(x\) in \(x^2\) and the \(x\) remaining known to be \(0\ (mod\ y_0)\). 
</p>

<p>
Hence, the condition \(x\ (mod\ y)\) is shown for all state updates and bases state to be invariant, completing the proof by Floyd's invariant method.
</p>
</div>
</div>

<div id="outline-container-org0a54b3a" class="outline-3">
<h3 id="org0a54b3a"><span class="section-number-3">2.4</span> The Algorithm Terminates</h3>
<div class="outline-text-3" id="text-2-4">
<p>
If we set \(z\) as our derived variable, and \(\forall z>1\), we see that every step converges \(z\) to the integer divisor of itself to two. At \(z=1\), \(z\) is set to \(0\). Therefore, the state machine follows a strictly descending derived variable which converges, meaning the algorithm terminates.
</p>

<p>
The new running time of the exponentiation, as we are constantly dividing by \(2\) on the derived variable count, is \(O(log(k))\) &#x2014; where \(k\) is the power by which to raise, a significant increase to the \(O(k)\) implementation.
</p>
</div>
</div>
</div>
</div>
</body>
</html>
