src/KBhalgos_ps_6_fsm.tex
% Created 2022-04-10 Sun 15:10
% Intended LaTeX compiler: xelatex
\documentclass[letterpaper]{article}
\usepackage{graphicx}
\usepackage{longtable}
\usepackage{wrapfig}
\usepackage{rotating}
\usepackage[normalem]{ulem}
\usepackage{amsmath}
\usepackage{amssymb}
\usepackage{capt-of}
\usepackage{hyperref}
\usepackage[margin=1in]{geometry}
\setlength{\parindent}{0pt}
\usepackage[margin=1in]{geometry}
\usepackage{fontspec}
\usepackage{svg}
\usepackage{tikz}
\usepackage{cancel}
\usepackage{pgfplots}
\usepackage{indentfirst}
\setmainfont[ItalicFont = HelveticaNeue-Italic, BoldFont = HelveticaNeue-Bold, BoldItalicFont = HelveticaNeue-BoldItalic]{HelveticaNeue}
\newfontfamily\NHLight[ItalicFont = HelveticaNeue-LightItalic, BoldFont       = HelveticaNeue-UltraLight, BoldItalicFont = HelveticaNeue-UltraLightItalic]{HelveticaNeue-Light}
\newcommand\textrmlf[1]{{\NHLight#1}}
\newcommand\textitlf[1]{{\NHLight\itshape#1}}
\let\textbflf\textrm
\newcommand\textulf[1]{{\NHLight\bfseries#1}}
\newcommand\textuitlf[1]{{\NHLight\bfseries\itshape#1}}
\usepackage{fancyhdr}
\usepackage{csquotes}
\pagestyle{fancy}
\usepackage{titlesec}
\usepackage{titling}
\makeatletter
\lhead{\textbf{\@title}}
\makeatother
\rhead{\textrmlf{Compiled} \today}
\lfoot{\theauthor\ \textbullet \ \textbf{2021-2022}}
\cfoot{}
\rfoot{\textrmlf{Page} \thepage}
\renewcommand{\tableofcontents}{}
\titleformat{\section} {\Large} {\textrmlf{\thesection} {|}} {0.3em} {\textbf}
\titleformat{\subsection} {\large} {\textrmlf{\thesubsection} {|}} {0.2em} {\textbf}
\titleformat{\subsubsection} {\large} {\textrmlf{\thesubsubsection} {|}} {0.1em} {\textbf}
\setlength{\parskip}{0.45em}
\renewcommand\maketitle{}
\author{Houjun Liu}
\date{\today}
\title{Algos PS\#6 FSM}
\hypersetup{
 pdfauthor={Houjun Liu},
 pdftitle={Algos PS\#6 FSM},
 pdfkeywords={},
 pdfsubject={},
 pdfcreator={Emacs 28.0.91 (Org mode 9.5.2)}, 
 pdflang={English}}
\begin{document}

\tableofcontents

:ID:       82B3744E-FD5D-4C0C-B2AB-35FD563A6171

\section{Fifteen Square Puzzle}
\label{sec:org2b0e5d7}
From the definition of the problem, we have the state \((A,B)\):

\begin{itemize}
\item \(A\) is a list \((a_1\ldots a_{15})\) with all the values skipping the empty square
\item \(B\) is a tuple \((X,Y)\) containing the coordinates of the empty square
\end{itemize}

We also define "out of order" as pairs of not-necessarily-continuous values that are not strictly increasing, and "parity" as \(mod\ 2\) of the number of out-of-order pairs plus the row number of the empty square.

\subsection{Defining Transitions}
\label{sec:orgbc03a26}
For every single case, there is four possible transitions to make

\begin{enumerate}
\item Move empty square up
\item Move empty square down
\item Move empty square left
\item Move empty square right
\end{enumerate}

\subsection{Proving Invariant}
\label{sec:org3b7fcff}
We will show that the base state has a specific parity. At \(((1\ldots 15), (4,4))\), the starting base state, it has parity \(0 + 4 = 0 (mod\ 2)\).

Let's declare parity \(=0\ (mod\ 2)\) as the invariant.

\subsection{Proving Invariant through Transitions}
\label{sec:orgb513b25}
Let's prove that invariant is invariant through all transitions. We will do so in pairs, as the "moving square" operation is isomorphic by up-down and left-right pairs.

\subsubsection{Moving Up-Down}
\label{sec:org383927e}
Moving the empty square up-down constitutes adding/removing three pairs of out-of-order items---shifting a empty square up would result in the item three-items-back to be moved ahead by three items. 

Adding three out-of-order pairs, plus subtracting one row from the empty square position, would result in a change in parity of \(3-1 = 0\ (mod\ 2)\). It follows that reversing the operation would result in \(-3+1=0\ (mod\ 2)\).

Shifting up/down does not change the invariant.

\subsubsection{Moving Left-Right}
\label{sec:org50c69ad}
Moving an empty square left-right neither changes the row number for the empty row nor the order of the items. Hence, it does not change the items that constitute the parity---making the parity the same and invariant.

\subsection{Proving Invariant to End}
\label{sec:org79fc603}
At the final end state, there is \({15 \choose 2}-1\) out of order pairs (choose any of the tiles, choose any other one, swapping the order would be the same choice, but choosing two of the same is not.)

Hence:

\begin{equation}
\frac{15!}{2!(13!)} -1 = \frac{15\times14}{2} -1 = 104
\end{equation}

At the final state, the empty row is at row \(4\). \(4+104 = 0\ (mod\ 2)\), maintaining the invariant.

By Floyd's invariant method, we see that the final state is still invariant and hence reachable from the base state via the Moving Up-Down and Moving Left-Right operations.

\section{Fast Exponentiation}
\label{sec:org6afd8c8}

\subsection{Analyzing Traditional Exponentiation}
\label{sec:org7207395}
The running time of traditional exponentiation is \(O(k)\), where \(k\) is the power by which to raise. This is simply because an increase in the power of \(k\) will result in a linear \(+1\) increase in the number of multiplications.

\subsection{Fast Exponentiation as FSM}
\label{sec:org321c962}
Base state: \((a,1,b)\).

At every state \((x,y,z)\):

If \(z\) is odd:

\begin{itemize}
\item Set \(y=xy\)
\item Set \(z=\frac{z-1}{2}\)
\end{itemize}

If \(z\) is even:

\begin{itemize}
\item Set \(z= \frac{z}{2}\)
\end{itemize}

Finally, \(x = x^2\)

Furthermore, \(z\) is our derived variable counting down to \(0\). If \(z=0\), \(y\) is the result returned. 

\subsection{FSM Proof}
\label{sec:org873dfdc}
We will set the fact that \(x\ (mod\ y) = 0\) as our invariant. At the base state, where \(y=1\), this is trivially true.

At every state update, the value of \(y\) either stays unchanged or is scaled by \(x\).

In the former case, our new value of \(x={x_0}^2\) is also \(0\ (mod\ y_0)\) as \(na=0\ (mod\ b)\) if \(a=0\ (mod\ b)\).

In the latter case, the new value of \$x\$---\(x^2\), per every step---is also \(0\ (mod\ y)\) as we can separate the new value of y into \(y = xy_0\), which the former \(x\) term dividing out one of the two \(x\) in \(x^2\) and the \(x\) remaining known to be \(0\ (mod\ y_0)\). 

Hence, the condition \(x\ (mod\ y)\) is shown for all state updates and bases state to be invariant, completing the proof by Floyd's invariant method.

\subsection{The Algorithm Terminates}
\label{sec:org02ea279}
If we set \(z\) as our derived variable, and \(\forall z>1\), we see that every step converges \(z\) to the integer divisor of itself to two. At \(z=1\), \(z\) is set to \(0\). Therefore, the state machine follows a strictly descending derived variable which converges, meaning the algorithm terminates.

The new running time of the exponentiation, as we are constantly dividing by \(2\) on the derived variable count, is \$O(log(k))\$---where \(k\) is the power by which to raise, a significant increase to the \(O(k)\) implementation.
\end{document}